#include<stdio.h>
#include<iostream>
int main(){
	setlocale(LC_ALL, "Russian");
	
char name1[9], name2[9], name3[9];
char typ1[3], typ2[3], typ3[3];
int  nom1, nom2;
float nom3;
 int qua1, qua2, qua3;

//Введение фактических данных
printf("1. Введите обозначение, тип, номинал, количество >");	
scanf_s("%s %s %d %d", name1,9, typ1,3, &nom1, &qua1);
printf("2. Введите обозначение, тип, номинал, количество >");
scanf_s("%s %s %d %d", name2,9, typ2,3, &nom2, &qua2);
printf("3. Введите обозначение, тип, номинал, количество >");
scanf_s("%s %s %f %d", name3,9, typ3,3, &nom3, &qua3);

//Вывод таблицы 
// вывод заголовков
printf("___________________________________________\n");
printf("|Ведомость комплектующих                   |\n");
printf("|__________________________________________|\n");
printf("| Обозначение | Тип | Номинал | Количество |\n");
printf("|_____________|_____|_________|____________|\n");

// вывод строк фактических данных 
printf("| %9s   |  %s  | %d  |    %d      |\n", name1, typ1, nom1, qua1);
printf("| %9s   |  %s  | %d   |    %d      |\n", name2, typ2, nom2, qua2);
printf("| %9s   |  %s  | %.1f    |    %d       |\n", name3, typ3, nom3, qua3);
  
//вывод примечаний 
printf("|__________________________________________|\n");
printf("|Примечание: R - резистор; C - конденсатор |\n");
printf("|__________________________________________|\n");
return 0;
}

